return {
    --集群
    cluster = {
        node1 = "127.0.0.1:7771",
        node2 = "127.0.0.1:7772",
    },
    
    --全局服务：agent管理服务
    agentmgr = { node = "node1" },
    --全局服务：场景服务
    scene = {
        node1 = { 1001, 1002 },
        --node2 = { 1003 },
    },

    --节点1
    node1 = {
        -- 本地服务：网关服务
        gateway = {
            [1] = { port = 8001 },
            [2] = { port = 8002 },
        },
        -- 本地服务：登录服务
        login = {
            [1] = {},
            [2] = {},
        },
    },

    --节点2
    node2 = {
        -- 本地服务：网关服务
        gateway = {
            [1] = { port = 8011 },
            [2] = { port = 8022 },
        },
        -- 本地服务：登录服务
        login = {
            [1] = {},
            [2] = {},
        },
    },
}
